(function() {
const Data = [
    {"1901":63,"1902":77,"1903":45,"1904":-43,"1905":-23,"1906":25,"1907":87,"1908":-57,"1909":-89,
    "1910":-18,"1911":11,"1912":3,"1913":0,"1914":0,"1915":-63,"1916":48,"1917":-853,"1918":-9032,"1919":-13363,"1920":291,
    "1921":509,"1922":736,"1923":713,"1924":963,"1925":717,"1926":865,"1927":1155,"1928":939,"1929":734,"1930":738,"1931":-462,
    "1932":-2735,"1933":-2602,"1934":-3586,"1935":-2803,"1936":-4304,"1937":-2193,"1938":-89,"1939":-2846,"1940":-2920,"1941":-4941,
    "1942":-20503,"1943":-54554,"1944":-47557,"1945":-47553,"1946":-15936,"1947":4018,"1948":11796,"1949":580,"1950":-3119,"1951":6102,
    "1952":-1519,"1953":-6493,"1954":-1154,"1955":-2993,"1956":3947,"1957":3412,"1958":-2769,"1959":-12849,"1960":301,"1961":-3335,
    "1962":-7146,"1963":-4756,"1964":-5915,"1965":-1411,"1966":-3698,"1967":-8643,"1968":-25161,"1969":3242,"1970":-2842,"1971":-23033,
    "1972":-23373,"1973":-14908,"1974":-6135,"1975":-53242,"1976":-73732,"1977":-53659,"1978":-59185,"1979":-40726,"1980":-73830,"1981":-78968,
    "1982":-127977,"1983":-207802,"1984":-185367,"1985":-212308,"1986":-221227,"1987":-149730,"1988":-155178,"1989":-152639,"1990":-221036,"1991":-269238,
    "1992":-290321,"1993":-255051,"1994":-203186,"1995":-163952,"1996":-107431,"1997":-21884,"1998":69270,"1999":125610,"2000":236241,
    "2001":128236,"2002":-157758,"2003":-377585,"2004":-412727,"2005":-318346,"2006":-248181,"2007":-160701,"2008":-458553,"2009":-1412688,
    "2010":-1294373,"2011":-1299599,"2012":-1076573,"2013":-679775,"2014":-484793,"2015":-441960,"2016":-584650,"2017":-665450,"2018":-779074,
    "2019":-983588,"2020":-3132456,"2021":-2775350,"2022":-1375920,"2023":-1695240,"2024":-1832816}
]


const dates = Object.keys(Data[0]);
const values = Object.values(Data[0]);


const tooltipConfig = window.innerWidth > 768 ? {
  trigger: "axis",
  formatter: (params) => {
    const v = params[0].value;
    const sign = v > 0 ? '+' : '';
    let formatted = Math.abs(v) >= 1e6 ? `${sign}${(v/1e6).toFixed(1)} Trilhões` 
                    : Math.abs(v) >= 1e3 ? `${sign}${(v/1e3).toFixed(1)} Bilhões`
                    : `${sign}${v.toFixed(1)} Milhões`;
    return `<strong>${params[0].name}</strong><br/>${formatted}`;
  }
} : { show: false };

  const option = {
    tooltip: tooltipConfig,
    xAxis: {
      type: "category",
      data: dates,
      axisLabel: {
        rotate: 45,
        fontSize: 16,
        fontWeight: "bold",
        color: "#333333",
        interval: 0,
        formatter: (value) => {
            const showLabels = [1901, 1971, 2024];
            return showLabels.includes(Number(value)) ? value : "";
          },
      },
      axisTick: {
        show: false,
      },
    },
    yAxis: {
      type: "value",
      name: "Bilhões de $",
      max: 250,
      nameLocation: "end",
      axisLabel: {
        fontSize: 16,
        formatter: value => `${(value/1e3).toFixed(0)}`
      },
      splitLine: {
        show: true,
        lineStyle: {
          type: "dashed",
          color: "#f3f3f3",
        },
      },
    },
    series: [
      {
        type: "line",
        data: values,
        smooth: true,
        symbol: "none",
        lineStyle: {
          color: "rgb(96, 96, 96)",
          width: 2,
        },
        areaStyle: {
          color: new echarts.graphic.LinearGradient(0, 0, 0, 1, [
            { offset: 0, color: "rgba(62, 65, 63, 0.3)" },
            { offset: 1, color: "rgba(255, 255, 255, 0.49)" },
          ])
        },
      },
    ],
    grid: {
      left: "5%",
      right: "5%",
      bottom: "5%",
      top: "7%",
      containLabel: true,
    },
  };

  const chart = echarts.init(document.getElementById("superavit-federal"));
  chart.setOption(option);
  window.addEventListener("resize", () => chart.resize());

})();